const ForumPage = () => {
    return (
        <div className={"w-full py-20"}>
                <div className={"container mx-auto"}>
                        <div>
                            - Общие обсуждения
                            - Новости IT-индустрии
                            - Обсуждение новых технологий
                            - Свободные темы

                            - Языки программирования
                            - Python
                            - JavaScript
                            - C++
                            - Java
                            - Другие языки

                            - Инструменты и технологии
                            - Базы данных (SQL, MongoDB)
                            - Фреймворки (React, Django)
                            - Системы контроля версий (Git)
                            - CI/CD (Docker, Jenkins)

                            - Проекты и портфолио
                            - Мои проекты
                            - Совместные проекты
                            - Обзор портфолио

                            - Решение задач и конкурсы
                            - Еженедельные задачи
                            - Конкурсы и хакатоны
                            - Лидеры

                            - Карьера и развитие
                            - Советы по карьерному росту
                            - Подготовка к собеседованиям
                            - Вакансии и стажировки
                        </div>

                        <div>
                                Примеры тем и постов на форуме
                                Python: Как оптимизировать этот код?

                                React: Проблема с хуками, кто-нибудь сталкивался?

                                Карьера: Как успешно пройти техническое собеседование?

                                Новости IT: Новые возможности в последней версии Java
                        </div>

                </div>
        </div>
    )
}

export default ForumPage;