"use client"
import { Typography, Divider } from 'antd';
const { Title } = Typography;

const BashPage = () => {
    return (
        <div>
            <div>
                <Divider plain>
                    <Title>
                        Добро пожаловать на курс по Bash! 🎉📜
                    </Title>
                </Divider>
            </div>


            Bash — это мощный командный интерпретатор, используемый для автоматизации задач и управления системами. На этом курсе вы узнаете, как создавать скрипты Bash, управлять файлами и процессами, а также автоматизировать рутинные задачи.

            Приготовьтесь к эффективному и увлекательному обучению! 🚀
        </div>
    )
};

export default BashPage;