'use client'
import {Card} from "antd";
import React from 'react';
import {ProgramCardBlock} from "@/app/widgets/ProgramCardBlock";

const Home: React.FC = () => {
    return (
        <ProgramCardBlock />
    );
};

export default Home;

// карточки языков программирования
// ссылки на страницы
// авторизация
// регистрация
// материалы для кода(информация) + копирование
// тесты
// материалы для тестов
// сделать задания
// сделать песочницу для заданий
// основные темы(темы для изучения/повторения
// вопросы с собеседований
// тесты для тг бота + ссылка на тг бота
// тесты для тг бота(парсить из канала, либо брать из бд)
// если тесты блять из бд, то для админа добавить, изменить или удалить
// мессенджер со мной
