export const cheatsheetsArray = [
    {
        img: "c_programming_language.svg.png",
        title: "The C Cheatsheet",
        description: "Универсальный язык программирования общего назначения, широко используемый для системного и встроенного программирования благодаря своей эффективности и контролю над низкоуровневыми процессами.",
        link: "c_programming_language",
    },
    {
        img: "avf53t8xe.png",
        title: "The C# Cheatsheet",
        description: "Объектно-ориентированный язык программирования, разработанный Microsoft. Широко используется для разработки приложений под платформу .NET, веб-приложений, игр и корпоративного ПО благодаря своей мощности и многофункциональности.",
        link: "csh_programming_language",
    },
    {
        img: "C++_logo.png",
        title: "C++",
        description: "Объектно-ориентированный язык программирования общего назначения, используемый для системного программирования, разработки игр и приложений с высокими требованиями к производительности.",
        link: "cpp_programming_language",
    },
    {
        img: "Bash_Logo_black_and_white_icon_only.svg.png",
        title: "Bash",
        description: "Популярный командный интерпретатор Unix/Linux, используемый для выполнения команд в терминале. Bash позволяет пользователям автоматизировать задачи, создавать скрипты, управлять файлами и процессами, а также настраивать рабочую среду.",
        link: "bash_language"
    },
    {
        img: "javascript-logo.png",
        title: "The JavaScript Cheatsheet",
        description: "Скриптовый язык высокого уровня, наиболее часто используемый для создания интерактивных веб-страниц. Поддерживается всеми основными браузерами и позволяет создавать динамические веб-интерфейсы.",
        link: "javascript_programming_Language",
    },
    {
        img: "Python-logo-notext.svg.png",
        title: "The Python Cheatsheet",
        description: "Интерпретируемый язык высокого уровня, известный своей простотой и читабельностью. Часто используется для веб-разработки, научных вычислений, анализа данных, искусственного интеллекта и автоматизации задач.",
        link: "python_language",
    },
    {
        img: "golang-progr-lang.png",
        title: "The Golang Cheatsheet",
        description: "Системный язык программирования, разработанный Google. Известен своей простотой, производительностью и отличной поддержкой параллельного программирования, что делает его популярным для разработки серверного ПО и облачных сервисов.",
        link: "golang_programming_language",
    },
    {
        img: "HTML5_logo_and_wordmark.svg.png",
        title: "The HTML5 Cheatsheet",
        description: "Последняя версия стандарта HTML, используемого для создания веб-страниц. HTML5 добавляет новые элементы и атрибуты для поддержки мультимедиа, графики, интерактивного контента и улучшенной семантики, обеспечивая более богатый пользовательский опыт.",
        link: "html5_hypertext_markup_language"
    },
    {
        img: "CSS3_logo_and_wordmark.svg.png",
        title: "The CSS3 Cheatsheet",
        description: "Обновление языка каскадных таблиц стилей, используемого для описания внешнего вида веб-страниц. CSS3 добавляет новые возможности, такие как анимации, градиенты, адаптивный дизайн, и более сложные селекторы, что позволяет дизайнерам создавать более привлекательные и динамичные веб-интерфейсы.",
        link: "css_cascading_style_sheets_language"
    },
    {
        img: "nextjs-icon-1024x1024-5et230l7.png",
        title: "Next.js",
        description: "Фреймворк React для серверного рендеринга и генерации статических сайтов. Обеспечивает отличную производительность, поддерживает маршрутизацию и API на основе файловой системы.",
        link: "nextjs"
    },
    {
        img: "react.png",
        title: "React.js",
        description: "Библиотека JavaScript для создания пользовательских интерфейсов. Обеспечивает компонентный подход и виртуальный DOM для эффективного обновления пользовательского интерфейса.",
        link: "reactjs"
    },
    {
        img: "nestjs-icon-2048x2040-3rrvcej8.png",
        title: "Nest.js",
        description: "Прогрессивный фреймворк для создания масштабируемых и эффективных серверных приложений на TypeScript с использованием модульной архитектуры и принципов ООП.",
        link: "nestjs"
    },
    {
        img: "bg,f8f8f8-flat,750x,075,f-pad,750x1000,f8f8f8.u2.jpg",
        title: "Express.js",
        description: "Минималистичный веб-фреймворк для Node.js, используемый для создания серверных приложений и API. Поддерживает маршрутизацию, обработку запросов и промежуточное ПО.",
        link: "expressjs"
    },
    {
        img: "Mongodb-PNG-Image-HD.png",
        title: "MongoDb",
        description: "Документо-ориентированная NoSQL база данных. Обеспечивает гибкость в хранении и управлении данными, поддерживая JSON-подобные документы.",
        link: "mongodb"
    },
    {
        img: "sql-database-generic-icon-1521x2048-d0vdpxpg.png",
        title: "SQL",
        description: "Стандартизированный язык запросов для управления реляционными базами данных. Используется для создания, изменения и запроса данных в таблицах.",
        link: "sql"
    },
    {
        img: "GraphQL_Logo.svg.png",
        title: "GraphQl",
        description: "Свременный язык запросов для API, который был разработан Facebook для улучшения взаимодействия с данными.",
        link: "graphql"
    },
    {
        img: "Typescript_logo_2020.svg.png",
        title: "TypeScript",
        description: "Надстройка над JavaScript, добавляющая строгую типизацию и современные возможности языка. Помогает избежать ошибок и улучшает читаемость кода.",
        link: "typescript"
    },
    {
        img: "Git-Icon-1788C.png",
        title: "Git",
        description: "Распределенная система контроля версий, используемая для управления изменениями в исходном коде. Позволяет отслеживать изменения, работать в команде и возвращаться к предыдущим версиям кода.",
        link: "git"
    },
    {
        img: "node-js-icon-1817x2048-g8tzf91e.png",
        title: "Node.js",
        description: "Среда выполнения JavaScript вне браузера. Позволяет создавать серверные приложения с высокой производительностью и масштабируемостью благодаря событийной модели ввода-вывода.",
        link: "nodejs"
    },
    {
        img: "Docker_(container_engine)_logo_(cropped).png",
        title: "Docker (DevOps CI/CD)",
        description: "Платформа для контейнеризации приложений. Позволяет упаковывать приложения и их зависимости в контейнеры, обеспечивая портативность и консистентность во всех средах разработки и эксплуатации.",
        link: "docker"
    },
    {
        img: "redis-original-wordmark-icon-2045x2048-nz2tg5u6.png",
        title: "Redis",
        description: "Высокопроизводительная NoSQL база данных в памяти. Используется для кэширования, управления сессиями и других задач, требующих быстрого доступа к данным.",
        link: "redis"
    },
    {
        img: "algorithms.png",
        title: "структуры данных и алгоритмы",
        description: "основы и принципы структур данных и алгоритмов, которые являются краеугольным камнем эффективного программирования и разработки программного обеспечения.",
        link: "data_structures_and_algorithms"
    },
];
