"use client"
import { Typography, Divider } from 'antd';
const { Title } = Typography;

const CppProgrammingLanguagePage = () => {
    return (
        <div className={"w-full"}>
            <div className={"container mx-auto"}>
                <Divider plain>
                    <Title>
                        Добро пожаловать на курс по программированию на C++! 🎉🛠️
                    </Title>
                </Divider>
            </div>


            Вы готовы исследовать один из самых мощных и сложных языков программирования? На этом курсе мы изучим основы и продвинутые концепции C++, включая объектно-ориентированное программирование, управление памятью и создание высокопроизводительных приложений.

            Вас ждет увлекательное путешествие в мир C++! 🚀
        </div>
    )
}

export default CppProgrammingLanguagePage;