"use client"
import { Typography, Divider } from 'antd';
const { Title } = Typography;

const C_Programming_Language = () => {
    return (
        <div className={"w-full"}>
                <Divider plain>
                    <Title>
                        Добро пожаловать на курс по программированию на языке C! 🎉🔧
                    </Title>
                </Divider>
            <div className={"container mx-auto"}>
            </div>


            Вы сделали первый шаг в мир одного из самых мощных и универсальных языков программирования. В течение курса вы изучите основы языка C, его синтаксис и ключевые особенности. Мы научимся создавать эффективные и высокопроизводительные программы, которые лежат в основе многих современных технологий.

            Готовы начать это путешествие? Давайте погрузимся в мир C и откроем для себя его возможности! 🚀
        </div>
    )
}

export default C_Programming_Language;